tutorials/heatTransfer/chtMultiRegionFoam/externalCoupledMultiRegionHeater/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory


# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

./Allrun.pre

#-- Run on single processor
#runApplication $(getApplication) &
# Simulated external solver
#runApplication ./externalSolver

# Decompose
runApplication decomposePar -allRegions

# Run OpenFOAM
runParallel $(getApplication) &

# Simulated external solver
runApplication ./externalSolver

# Reconstruct
runApplication reconstructPar -allRegions


# ----------------------------------------------------------------- end-of-file
